import 'package:azkar/model/story_model.dart';

List<StoryBodyData> ababakrData = [
  StoryBodyData(
      answer:
          '''عبد الله بن عثمان بن عامر بن عمرو بن كعب بن سعد بن تيم بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر -وهو قريش- بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان، التيمي القرشي.''',
      title: "اسم ابو بكر ونسبة"),
  StoryBodyData(
      answer:
          '''الصِّدِّيق: لقبه به رسول الله  ﷺبعد حادثة الإسراء والمعراج، عن أم المؤمنين عائشة رضي الله عنها: لما أسري بالنبي ﷺ  إلى المسجد الأقصى أصبح يتحدث الناس بذلك، فارتدّ ناس كانوا آمنوا به وصدقوه، وسعى رجال إلى أبي بكر، فقالوا: (هل لك إلى صاحبك؟ يزعم أن أسري به الليلة إلى بيت المقدس)، قال: (وقد قال ذلك؟)، قالوا: نعم، قال: (لئن قال ذلك فقد صدق)، قالوا: أو تصدقه أنه ذهب الليلة إلى بيت المقدس، وجاء قبل أن يصبح؟ قال: (نعم، إني لأصدقه فيما هو أبعد من ذلك، أصدقه بخبر السماء في غدوة أو روحة).

العتيق: أطلقه عليه رسول الله ﷺ، قالت السيدة عائشة: دخل أبو بكر الصديق على رسول الله ﷺ، فقال له رسول الله ﷺ: (أبشر، فأنت عتيق الله من النار)، وقيل لأنه كان جميل الوجه وحسن الشكل، وهو من الألقاب المشهورة بين العرب للدلالة على جمال وجه الرجل وكرمه.

الصاحب: لقب ذكر في القرآن الكريم: {إِلاَّ تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُواْ ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُواْ السُّفْلَى وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا وَاللَّهُ عَزِيزٌ حَكِيمٌ}.

الأتقى: لُقب به في القرآن الكريم: {وَسَيُجَنَّبُهَا الأَتْقَى}.

الأوّاه: لقب يدل على الخشية والوجل من الله تعالى، قال إبراهيم النخعي: (كان أبو بكر يسمى بالأواه؛ لرأفته ورحمته).''',
      title: "القاب ابو بكر الصديق"),
  StoryBodyData(
      answer:
          '''كان أبو بكر أول من آمن بدعوة النبيﷺ، فما إن عرض عليه ﷺ الإسلام حتى أسلم، ولم يتردد لحظة واحدة، عن عبد الله بن مسعود قال رسول الله ﷺ: (ما دَعوتُ أحدًا إلى الإسلامِ إلَّا كانتْ له كَبوةٌ، غيرَ أبي بَكرٍ؛ فإنَّه لم يَتلعثَمْ)، وبدأ يدعو إلى الله بنفسه وماله.''',
      title: "اسلام ابو بكر الصديق"),
  StoryBodyData(
      answer:
          '''صحب النبي ﷺ في هجرته إلى المدينة، وذلك بعد ازدياد تعرض المشركين للنبي ﷺوأصحابه، فاستأذن أبو بكر رسول الله ﷺفي الهجرة فأمر رسول الله أبا بكر ألّا يعجل؛ لعلّ الله يجعل له صاحباً في الهجرة، فاستبشر أبو بكر وتأمل أن يكون رسول الله ﷺ هو رفيقه في الهجرة، فاشترى راحلتين واعتنى بهما (من باب تجهيز نفسه للهجرة).

وقد كان من عادة رسول الله ﷺ أن يأتي بيت أبي بكر بكرةً وعشياً، وفي اليوم الذي أذن الله له بالهجرة أتاه في غير الوقت المعتاد، فلما رآه أبو بكر علم أنّ هنالك خطب ما، وكان عند أبي بكر ابنتيه عائشة وأسماء -رضي الله عنهما-، فطلب من أبي بكر أن يُخرج من عنده، قائلاً له: (أخْرِجْ مَن عِنْدَكَ، قالَ: يا رَسولَ اللَّهِ إنَّما هُما ابْنَتَايَ، يَعْنِي عَائِشَةَ وأَسْمَاءَ)، فأخبره النبي ﷺ بأمر الهجرة.

فاستأجرا عبد الله بن أُريقط دليلاً على الطّريق، وبعد ذلك سارا حتى وصلا جبل ثور، فمكثا فيه ثلاث ليال، وكانت قريش قد جعلت مكافأة لمن يأتي برسول الله ﷺ وأبو بكر أسيرين أو مقتولين، ووصل المشركون إلى الغار، وصعد بعضهم أعلى الغار للبحث عنهما، ونظر أبو بكر الصديق إلى أقدام المشركين على باب الغار، فهمس إلى النبي ﷺ: (لو أن أحدهم نظر إلى قدميه لأبصرنا)، فرد ﷺ بإيمان وسكينة: (يا أبا بكر ما ظنك باثنين الله ثالثهما؟).''',
      title: "هجرة ابو بكر الصديق"),
  StoryBodyData(
      answer: '''شهد مع النبي ﷺ كل الغزوات:

غزوة بدر سنة (2هـ): كانت له فيها مواقف عظيمة، شارك ابنه عبد الرحمن في صف المشركين، فلما أسلم قال لأبيه: (لقد أهدفت لي (أي ظهرت أمامي) يوم بدر، فملت عنك ولم أقتلك)، فقال له أبو بكر: (لو أهدفت لي لم أمل عنك).
غزوة أحد سنة (3هـ): لما شاع أن الرسولَ ﷺ قد قُتل، شقَّ أبو بكر الصفوف، وكان أولَ من وصل إلى الرسول ﷺ.
غزوة بني النضير سنة (4هـ).
غزوة بني المصطلق سنة (5هـ).
غزوة الخندق سنة (5هـ).
غزوة بني قريظة سنة (5هـ).
صلح الحديبية سنة (6هـ).
غزوة خيبر سنة (7هـ).
عمرة القضاء سنة(7هـ).
فتح مكة سنة (8هـ).
غزوة حنين سنة (8هـ).
غزوة تبوك سنة (8هـ): وكان يحمل لواء الرسول ﷺ.''',
      title: "غزوات ابو بكر الصديق"),
  StoryBodyData(
      answer: '''سرية نجد: وكان الأمير على المسلمين فيها.
غزوة بني فزارة: وكان الأمير على المسلمين فيها.
سرية ذات السلاسل سنة (8هـ).
أرسله النبي ﷺ أميراً على الحج سنة (9هـ).
شهد حجة الوداع مع النبي ﷺ سنة (10هـ).''',
      title: "السرايا التي كان بها أو قادها"),
  StoryBodyData(
      answer:
          '''ظهرت حكمته ورباطة جأشه في مواجهة مصاب الأمة بوفاة النبي ﷺ، كما ظهرت شخصيته القوية وحنكته السياسية في اجتماع السقيفة، وقد عبر عن تواضع جم، وزهد في الخلافة حين رُشِّح لها، مزكيًا لها سالم مولى أبي حذيفة، واصفًا إياه بأنه أتقى منه، أو عمر بن الخطاب كونه أقوى منه، غير أن عمر رفض إلا أن يبايع أبا بكر، وإذا بالقوم يبايعوا أبا بكرٍ خليفةً لرسول الله ﷺ.ذلك أنه لما علم الأنصار وفاة النبي ﷺ؛ اجتمعوا في سقيفة بني ساعدة يتشاورون، وبلغ ذلك المهاجرين فقالوا: نرسل إليهم يأتوننا، فقال أبو بكر بل نمشي إليهم، فسار إليهم ومعه عمر بن الخطاب، فتحاوروا كثيرًا وكادوا يختلفون، فقال بعض الأنصار منا أمير ومنكم أمير، فقال أبو بكر: نحن الأمراء وأنتم الوزراء؛ فإن رسول الله ﷺ  قال: (الأئمة من قريش)، وقال ﷺ: (أوصيكم بالأنصار خيرًا: أن تقبلوا من محسنهم وتتجاوزوا عن مسيئهم).

وقال عمر: (أنشدتكم الله هل تعلمون أن رسول الله ﷺ أمر أبا بكر أن يصلي بالناس؟) قالوا: اللهم نعم، قال: (فأيكم تطيب نفسه أن يزيله عن مقام أقامه فيه رسول الله ﷺ؟) فقالوا: كلنا لا تطيب نفسه، ونستغفر الله، وسارعوا جميعًا بالبيعة لأبي بكر، فكان لتلك البيعة الفضل في  تجميع كلمة المسلمين، وتجنيبهم فتنة ضارية وانقسامًا وخيمًا، وحربًا ضروسًا بين أبناء الدين الواحد لا يعلم مداها إلا الله وحده.''',
      title: "خلافة ابو بكر الصديق"),
  StoryBodyData(
      answer:
          '''من أعظم مناقب الصديق رضي الله عنه قاطبة أنه وُصِف بأوصاف رسول الله ﷺ، تقول عائشة رضي الله عنها: ” خَرَجَ أَبُو بَكْرٍ مُهَاجِرًا قِبَلَ الحَبَشَةِ، لَقِيَهُ ابْنُ الدَّغِنَةِ، فَقَالَ: أَيْنَ تُرِيدُ يَا أَبَا بَكْرٍ؟ فَقَالَ أَبُو بَكْرٍ: أَخْرَجَنِي قَوْمِي، فَأَنَا أُرِيدُ أَنْ أَسِيحَ فِي الأَرْضِ، فَأَعْبُدَ رَبِّي، قَالَ ابْنُ الدَّغِنَةِ: إِنَّ مِثْلَكَ لاَ يَخْرُجُ وَلاَ يُخْرَجُ، فَإِنَّكَ تَكْسِبُ المَعْدُومَ، وَتَصِلُ الرَّحِمَ، وَتَحْمِلُ الكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الحَقِّ، وَأَنَا لَكَ جَارٌ، فَارْجِعْ فَاعْبُدْ رَبَّكَ بِبِلاَدِكَ،

فقد وصف ابنُ الدَّغِنَة أبا بكر رضي الله عنه بالأوصاف نفسها التي وصفت بها خديجة رضي الله عنها رسولَ الله ﷺ، وذلك على غير اتفاق بينهما، ولم يوصف بهذه الصفات مجتمعة أحد غيرهما، حتى نقول إنَّ هذه الصفات كانت تُجْمَع للأشراف الكرماء، إنما كان اجتماع هذه الصفات في شخص واحد أمرًا فريدًا في هذا المجتمع، ولعلَّ هذا الذي يُفَسِّر لنا الدرجة العالية التي وصل إليها الصديق رضي الله عنه في ميزان الإسلام؛ فالرجل كان يُقَدِّم ما لا يُقَدِّمه غيره، ويفعل ما لا يستطيع أحدٌ أن يُنافسه فيه.''',
      title: "فضائل ابو بكر الصديق"),
  StoryBodyData(
      answer:
          '''مرض أبو بكر الصديق سنة (13هـ)، وقد اختُلف في سبب وفاته، فذكرت السيدة عائشة أنه اغتسل في يوم بارد فحمّ ومرض خمسة عشر يومًا حتى مات، وقيل أنه سُمّ، ومات يوم الاثنين، وله من العمر (63) سنة، كعمر رسول الله ﷺ، وقد أوصى أن تغسله زوجه “أسماء بنت عميس”، وأوصى ابنته عائشة أن يُدفن إلى جوار صاحب دربه رسول الله ﷺ، وصلى عليه عمر بن الخطاب، ونزل قبره عمر وعثمان وطلحة وابنه عبد الرحمن.

استمرت خلافة أبي بكر الصديق سنتين وثلاثة أشهر، كانت مليئة بالإنجازات العظيمة والأحداث الخطيرة، وكانت مسرحًا للعديد من الحوادث الجسام التي كادت تعصف بدولة الإسلام في مهدها، لولا أن هيأ الله لها هذا الرجل الذي استطاع بحكمته وحزمه أن يصل بالمركب إلى شاطىء الأمان، رجل امتزجت فيه الشدة بالرحمة، والحكمة بالقوة، واللين بالحزم''',
      title: "وفاة ابو بكر الصديق"),
];
