import 'package:azkar/model/story_model.dart';

List<StoryBodyData> aliData = [
  StoryBodyData(
      answer:
          '''هو علي بن أبي طالب بن عبد المطلب بن هاشم بن عبد مناف ابن عم رسول الله ، وزوج ابنته فاطمة رضي الله عنها، ووالد سبطيه الحسن والحسين سيدي شباب أهل الجنة، له في الإسلام السابقة العظيمة، والمآثر الجليلة، فهو أول من أسلم من الصبيان، ونام في فراش رسول الله صلى الله عليه وسلم ليلة الهجرة''',
      title: "نشأة علي رضي الله عنه"),
  StoryBodyData(
      answer:
          '''علي بن أبي طالب (عبد مناف) بن عبد المطلب بن هاشم بن عبد مناف بن قصي بن كلاب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان''',
      title: "نسب علي بن أبي طالب"),
  StoryBodyData(
      answer:
          '''هو “أبو الحسن”؛ حيث كُني بذلك لأن ابنه الأكبر سُمي بالحسن، وهو ولده من فاطمة بنت رسول الله صلى اله عليه وسلم.
وهو “أبو تراب” وهي الكنية التي أطلقها عليه رسول الله صلى الله عليه وسلم
وهو أيضًا أبو “الحسن والحسين”.
وهو “أبو القاسم الهاشمي”.
وهو “أبة السبطين”.
وهو “أمير المؤمنين”.''',
      title: "كنية علي بن أبي طالب"),
  StoryBodyData(
      answer:
          '''اختلفت الآراء حول تحديد العام الذي وُلد به علي بن أبي طالب بين ولادته قبل بعثة النبي صلى الله عليه وسلم بخمس عشر سنة، أو بست عشر سنة، أو بعشر سنين، أو بخمس سنين.''',
      title: "مولد علي بن أبي طالب"),
  StoryBodyData(
      answer:
          '''تبدأ قصة إسلام علي بن أبي طالب بأنه كان يعيش في بيت رسول الله صلى الله عليه وسلم؛ وذلك بسبب الأزمة التي مرت بها قريش، وعلي بن أبي طالب؛ فأراد رسول الله صلى عليه وسلم أن يُخفف عن عمه فأخذ علي ليكفله، وأخذ عمه العباس جعفر ليكفله.

كان يُريد رسول الله صلى الله عليه وسلم أن يرد المعروف إلى عمه أبي طالب حين كفله صغيرًا؛ فكان من حسن حظ علي رضي الله عنه أن رباه رسول الله صلى الله عليه وسلم.''',
      title: "نشأة علي بن أبي طالب"),
  StoryBodyData(
      answer:
          '''ولما نزلت الرسالة برسول الله صلى الله عليه وسلم سمعها منه علي؛ فكان من أوائل من اعتنقوا الدين الإسلامي؛ حيث كان أول من أسلم من الصبيان.

ومن القصص التي رُويت في إسلام علي أنه وجد رسول الله صلى الله عليه وسلم وزوجه خديجة يُصليان؛ فتسائل علي عما يفعلانه؛ فأجابه رسول الله أن هذا دين الله تعالى الذي اصطفاه، وأدعوك إلى عبادة الله وحده، وأن تكفر باللات والعزى.

فتعجب علي لما سمعه، وأراد أن يستشير أبا طالب في هذا الأمر؛ فكره رسول الله أن يُحدث علي أبا طالب بالأمر، وطلب منه أن يكتم هذا الحديث إذا لم يُسلم.

وقضى علي ليلته يُفكر في الأمر، وعندما جاء لرسول الله وسأله عما عرض عليه؛ فأجابه الرسول أن يشهد بأنه لا إله إلا الله، وأن يكفر باللات والعزى؛ ففعل علي ما قاله الرسول، وأسلم معه، وأخفى إسلامه عن أبيه، وأعمامه، وظل يتخفى عندما يذهب إلى الصلاة مع رسول الله في شعاب مكة.''',
      title: "اسلام عي بن ابي طالب"),
  StoryBodyData(
      answer:
          '''اتصف علي بن أبي طالب بالشجاعة، ومن أشهر الدلالات على ذلك أنه عرض نفسه للخطر فداءً لرسول الله صلى الله عليه وسلم عندما مكث في فراش الرسول عند مجيء الكفار لقتل رسول الله.

شارك علي في جميع الغزوات مع رسول الله صلى الله عليه وسلم، ماعدا غزوة تبوك؛ حيث ولاه الرسول على المدينة في ذلك الوقت.

كان مقاتلًا شجاعًا، وقد حمل الراية في سن العشرين، وكان من أهم رجال الدولة الإسلامية بعد وفاة رسول الله صلى الله عليه وسلم في عهد الخلفاء الراشدين الذين سبقوه في الخلافة؛ حيث كانوا لا يُقدمون على أي أمر إلا باستشارته.''',
      title: "صفات علي بن ابي طالب"),
  StoryBodyData(
      answer:
          '''زوجه رسول الله من ابنته فاطمة في العام الثاني من الهجرة، وأنجب منها الحسن، والحسين، وتقول بعض الآراء أنه قد أنجب منها أولادًا غيرهم.

تزوج علي رضي الله عنه “أم البنين بنت حزام” بعد وفاة فاطمة، وأنجب منها العباس، وجعفر، وعبد الله، وعثمان.

ثم تزوج “ليلى بنت مسعود بن خالد النهشلي”، وأنجب منها أبا بكر، وعبيد الله.

ثم تزوج “أسماء بنت عميس الخثعمية”، وأنجب منها يحيى، ومحمد.''',
      title: "علي بن أبي طالب الزوج/الزوجة"),
  StoryBodyData(
      answer:
          '''أثناء خلافته للدوية الإسلامية استُشهد علي في العراق إثر الحروب التي قامت بينه، وبين معاوية، وقد تمنى من الله تعالى أن يُعجل له بوفاته، وقد أجابه الله تعالى''',
      title: "وفاة علي بن أبي طالب"),
];
