import 'package:azkar/model/story_model.dart';

List<StoryBodyData> ibrahimData = [
  StoryBodyData(
      answer:
          '''سيدنا إبراهيم (عليه السلام) يعتبر واحداً من أعظم الأنبياء والرسل في الإسلام. وفي الإسلام، يُعتبر إبراهيم أبا الأنبياء ويحظى بمكانة عظيمة. وُلِدَ إبراهيم في بابل، وهو مدينة تقع في العراق الحالي، وتمتد حياته في معظمها في منطقة بلاد الشام الحالية.

وفي القرآن الكريم والتراث الإسلامي، ترد العديد من القصص والمواقف التي تشير إلى شخصية إبراهيم ورسالته. من أبرز أولاده النبي إسماعيل (عليه السلام) والنبي إسحاق (عليه السلام).

تُشير الكثير من الأحاديث النبوية والتفسيرات الإسلامية إلى أن نسب النبي إبراهيم يعود إلى النبي نوح (عليه السلام)، ومنه إلى آدم (عليه السلام)، وهكذا يُعتبر إبراهيم جزءًا من سلسلة الأنبياء والرسل التي بعثها الله لتوجيه البشرية إلى الطريق الصحيح.''',
      title: "نسب سيدنا ابراهيم"),
  StoryBodyData(
      title: "قصّة إبراهيم مع عبدة الأصنام",
      answer:
          '''قصة إبراهيم مع عبادة الأصنام تعتبر واحدة من القصص الشهيرة في الإسلام والتي ذكرت في القرآن الكريم. وهي قصة تحكي عن إبراهيم (عليه السلام)، أحد أنبياء الله، وصراعه مع قومه ومعتقداتهم الوثنية.

تقول القصة إن إبراهيم كان شاباً يعيش في مجتمع يعبد الأصنام. وكان يشعر بالإيمان بالله الواحد والذي لا شريك له، فكان يتساءل عن كيفية إقناع قومه بترك عبادة الأصنام والتوجه نحو الإيمان بالله الواحد.

في إحدى الليالي، وبينما كان الناس نائمين، دخل إبراهيم معبد الأصنام ودمر جميع الأصنام باستثناء واحدة، ووضع الفأس بجانبها. وعندما استفاق الناس ورأوا المعبد دمر والأصنام محطمة، افترقوا يبحثون عن الجاني. 

حين علمت الناس بأن إبراهيم هو الذي دمر الأصنام، جلسوا معه ليحاكموه. فسألوه عما حدث، وقال لهم إبراهيم إن الكبرياء الأكبر من الأصنام قد دمرهم جميعاً، إلا هذه الأكبر منهم. 

ثم واجه إبراهيم قومه بطريقة حكيمة، حيث أخبرهم بأن الله الواحد هو الذي يستحق العبادة، وأن الأصنام التي يعبدونها لا تستطيع أن تضر ولا تنفع. ودعاهم إلى التوبة والتوجه نحو الله الواحد.

ومع مرور الزمن، بدأ بعض أفراد قوم إبراهيم يتبعونه في الإيمان بالله الواحد، وتبدأ قصة الإيمان والدعوة إلى الله في الانتشار بفضل جهود إبراهيم وصبره وحكمته.

تعتبر هذه القصة مثالاً للصبر والإيمان، وتظهر قوة الحجة العقلية في إقناع الآخرين بالحق وترك الباطل. وتعتبر شخصية إبراهيم (عليه السلام) قدوة في الإيمان والدعوة إلى الله.'''),
  StoryBodyData(
      answer:
          '''قصة سيدنا إبراهيم (عليه السلام) مع النمرود غير مذكورة بشكل محدد في القرآن الكريم، ولكن هناك بعض الروايات التي تتحدث عن لقاء بينهما.

وفي إحدى الروايات، يُقال أن النمرود كان ملكًا طاغيًا ومتعجرفًا يدّعي أنه إله ويأمر الناس بالخضوع له. وكانت هذه الظروف تعيش فيها قوم إبراهيم.

وفي إطار هذه القصة، يروى أن إبراهيم دعا النمرود إلى التوحيد وترك عبادة الأصنام، ولكن النمرود رفض وحاول إجبار إبراهيم على ترك دعوته. وحسب بعض الروايات، فإن النمرود حاول حرق إبراهيم في النار بسبب رفضه، لكن الله حفظ إبراهيم وجعل النار بردًا وسلامًا عليه.

هذه الروايات تسلط الضوء على صراع إبراهيم مع الطغاة والمتعجرفين الذين يدّعون الإلهية، وتظهر قوة إيمانه وصبره في مواجهة الظلم والطغيان. وهي تعتبر درسًا في الصبر والإيمان بالله والثبات على الحق في وجه الظلم والطغيان.''',
      title: "قصة سيدنا ابراهيم مع النمرود"),
  StoryBodyData(
      answer:
          '''قصة سيدنا إبراهيم مع الملائكة هي إحدى القصص الشهيرة التي تروى في القرآن الكريم، وتظهر في سورة هود وسورة الذاريات. هذه القصة تُظهر تجربة إبراهيم (عليه السلام) وإيمانه بالله وطاعته له.

تبدأ القصة عندما أتى الملائكة لزيارة إبراهيم وزوجته سارة. وفي البداية، لم يعلم إبراهيم أنهم ملائكة، لكنهم قدموا بشكل بشري طبيعي. عندما رأى إبراهيم الضيوف، استقبلهم بكرم وضيافة، وقدم لهم الطعام والشراب.

بينما كانوا يتناولون الطعام، سمع الملائكة يحديثون بأنهم قادمون لإعلان بشرى ولد صالح لإبراهيم وسارة، اللذين كانا في كبر سنهما ولم يكونا قادرين على الإنجاب. وعندما سمعت سارة هذا الكلام، ضحكت في نفسها بسبب التعجب من هذه البشرى.

ثم تعجب إبراهيم من ضيافتهم، وهو يدرك أنهم لا يأكلون ولا يشربون كالبشر العاديين، ولكنهم يُظهرون شكلهم البشري ليختبروا إيمانه وكرمه.

بعد ذلك، بدأت الملائكة في الكشف عن هدفهم، وأخبروا إبراهيم بأنهم قادمون لتدمير قوم لوط المجرمين، وأنهم جاءوا ليعطوا بشرى ولد صالح لإبراهيم وسارة.

وبالفعل، قدمت الملائكة هذه البشرى، ولم يكن ذلك بعيداً عن قدرة الله، فبعد وقت قصير، رزق إبراهيم بابن يدعى إسماعيل، وبعد ذلك أتاه النبي إسحاق.

تُعتبر قصة سيدنا إبراهيم مع الملائكة درسًا في الإيمان بقدرة الله ورحمته، وتظهر أهمية الضيافة والكرم في الإسلام، حيث يعتبر استقبال الضيف وإكرامه جزءًا مهمًا من الأخلاق الإسلامية.''',
      title: "قصة سيدنا ابراهيم مع الملائكة"),
  StoryBodyData(
      answer:
          '''قصة سيدنا إبراهيم مع الطيور الأربعة غير موجودة في القرآن الكريم أو السنة النبوية، ولا يوجد تأكيد على وجود هذه القصة في التراث الإسلامي الرسمي. ومع ذلك، يوجد العديد من القصص والأساطير التي تتناول شخصية سيدنا إبراهيم (عليه السلام) بأشكال مختلفة.

ربما يكون الذي تشير إليه بـ"الطيور الأربعة" هو الحديث الشهير في السنة النبوية الذي يتحدث عن إبراهيم (عليه السلام) عندما قطعت الطيور ووضعت في أربعة أجزاء، ثم أطلقها ودعاها فجاءت مطيعة إليه.

وفي إحدى الروايات، يُقال أن إبراهيم كان يعاني من فقر وحاجة شديدة، وكان يتساءل عن كيفية إيجاد الرزق والمعونة. وحسب هذه الرواية، جاءت الطيور وأخبرته بأن الله سيعينه ويرزقه من حيث لا يحتسب.

يُعتبر هذا الحديث محفزًا للإيمان والثقة بالله ورحمته، ويركز على فكرة أن الله يعلم احتياجاتنا ويوفر لنا من رحمته وإحسانه.

ومن المهم التنبيه إلى أن هذه القصص قد تكون تراثًا شعبيًا أو قصصًا شائعة في بعض الثقافات الإسلامية المحددة، ولكنها ليست موجودة في المصادر الرسمية للإسلام.''',
      title: "قصة سيدنا ابراهيم مع الطيور الاربعة")
];
