import 'package:azkar/model/story_model.dart';

List<StoryBodyData> mosaData = [
  StoryBodyData(
      answer:
          '''هو موسى بن عمران بن يصهر بن قاهث بن لاوي بن يعقوب بن إسحاق بن إبراهيم عليهم السلام، وقيل إنّ اسم أمّه يوخابد، وقد كان في عهد فِرعون مصر وامرأته آسية بنت مزاحم، وكان فرعون قبل ولادة موسى -عليه السلام- قد رأى رؤيا في المنام مضمونها: أنّ نارًا أقبلت من بيت المقدس حتى وصلت بيوت مصر فأحرقت القبط وتركت بني إسرائيل، فجزع فرعون وخاف خوفًا شديدًا، ودعا السحرة والكهنة لأجل ذلك، وطلب منهم أن يعبروا رؤياه، فقالوا: يخرج من هذا البلد، رجلٌ يكون على يده هلاك مصر، فأصدر فرعون أمرًا بأن لا يولد لبني إسرائيل مولودٌ ذكرٌ إلا ذُبح، فكان يقتل الذكور في عامٍ ويدع قتلهم في العام الذي يليه''',
      title: "نسب سيدنا موسي"),
  StoryBodyData(
      answer:
          '''يرتبط بموسى مع هارون -عليهما السلام- برابطة الأخوّة؛ فهارون هو أخو موسى الأكبر، يكبُر موسى بثلاث سنواتٍ، وقد وُلد هارون -عليه السلام- في العام الذي كان فرعون يمتنع فيه عن قتل المواليد الذكور، وكان سند موسى -عليه السلام- وداعمًا له في دعوته لفرعون وبني إسرائيل؛ إذ سأل موسى -عليه السلام- الله تعالى أن يرسل معه أخاه هارون؛ لمساندته في الدعوة، قال الله تعالى على لسان موسى عليه السلام: (وَاجعَل لي وَزيرًا مِن أَهلي* هارونَ أَخِي* اشدُد بِهِ أَزري* وَأَشرِكهُ في أَمري)''',
      title: "صلة قرابة موسي بهارون"),
  StoryBodyData(
      answer:
          '''رأى فرعون من موسى -عليه السلام- المعجزات الباهرات، فزاد خوفه وخشيته من سقوط مُلكه، ورفض الناس عبادته؛ فجَمَع سحرته وعرض عليهم مقال موسى -عليه السلام- وطلب منهم أن يحشدوا قوتهم ومكرهم؛ ليغلبوا، وأخبرهم بأنّ لهم مكافأةً لأن غلبوا موسى وسيكونون عندها من المقربينَ له، فعُيّن موعد اجتمع السحرة مع موسى؛ ليظهر كلٌّ منهم قوّته وصدق ادعائه، فرمى موسى -عليه السلام- عصاه فقلب الله -عزّ وجلّ- حالها وأصبحت حيّةً تسعى، وخُذل سحرة فرعون وانقلب السحر عليهم، وسرعان ما عرفوا أنّ الذي فعله موسى ليس من صنع البشر، وأنّ في ذلك دليلًا على أنَّ وراء هذا الفعل ربًّا عظيمًا، فآمنوا بربّ هارون وموسى عليهما السلام، وهو ما أغضب فرعون وجعله يهدّد السحرة بالعقاب الشديد.[٥]

واستمر فرعون بإنكار دعوة موسى وأمر بعدها وزيره هامان أن يبني له صرحًا عظيمًا؛ ظنّاً منه أنّه إذا صعد عليه سيصل إلى أبواب السماء ويرى إله موسى، وقد آمن مع موسى وهارون بنو إسرائيل، وأمرهم الله -عزّ وجلّ- أن يتخذوا من مصر بيوتًا لهم، وأمر موسى أن يستمرّ بوعظ المؤمنين، ويحثّهم على بذل الخير ويرغّبهم بما عند الله من نعيمٍ في الآخرة، وأمر فرعون بقتل موسى عليه السلام، إلّا أنّ موسى -عليه السلام- كان يثبِّت قومه ويدعوهم للصبر، ويؤكّد لهم أنَّ الله سَيُنجيهم من كَيدِ فرعون لا محالة،[٥] وقد أغرق الله تعالى فرعون وملأه وأنجى موسى ومن معه من المؤمنين، قال تعالى: (وَأَنجَيْنَا مُوسَى وَمَن مَّعَهُ أَجْمَعِينَ* ثُمَّ أَغْرَقْنَا الْآخَرِينَ).[٦]''',
      title: "دعوة موسى لفرعون"),
  StoryBodyData(
      answer:
          '''جاء موسى -عليه السلام- إلى بني إسرائيل برسالة الحق، وقد كانوا يعانون من ظلم فرعون وإلحاقه صنوف من العذاب بهم، وكان موسى -عليه السلام- يُصبّرهم، إلى أن جاء النصر من عند الله، وصدق الله وعده وكافأهم نتيجة صبرهم وتحمّلهم لأذى فرعون ومكّن لهم في الأرض، ولكنّ بني إسرائيل بعد ذلك تمرّدوا على موسى -عليه السلام- وطلبوا أن يجعل لهم إلهًا من دون الله، وعبدوا العجل''',
      title: "دعوة موسى لبني إسرائيل"),
  StoryBodyData(
      answer:
          '''نشأ موسى -عليه السلام- وشب في قصر فرعون، وكان يتردد على أمه على اعتبار أنها من أرضعته، وفي أحد الأيام وأثناء سيره في المدينة وجد رجلين يقتتلان، أحدهما من جند فرعون والآخر من بني إسرائيل، فأراد أن يفض النزاع بينهما فدفع جندي فرعون فمات من أثر دفعته. وعندما علم أن فرعون يبحث عن قاتله وشاع أن موسى من قتله، قرّر موسى -عليه السلام- الخروج من مصر والتوجّه إلى مدين؛ حيث تزوّج هناك بابنة الرّجل الصّالح مقابل أن يرعى له الأغنام فَترةً من الزّمان''',
      title: "هجرة النبي موسى إلى مدين"),
];
