import 'package:azkar/model/story_model.dart';

List<StoryBodyData> omarData = [
  StoryBodyData(
      answer:
          '''إنه عمر بن الخطاب بن نفيل بن عبد العزى بن رياح بن عبد الله بن قرط بن رزاح بن عدي بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر (وهو قريش) بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان، العدوي القرشي.''',
      title: "اسم عمر بن الخطاب كامل"),
  StoryBodyData(
      answer:
          '''عمر بن الخطاب -رضي الله عنه- وُلد في مكة المكرمة حوالي عام 590 ميلادي، أي بعد مولد النبي محمد -صلى الله عليه وسلم- بحوالي ثلاث عشرة سنة تقريباً.''',
      title: "متى ولد عمر بن الخطاب"),
  StoryBodyData(
      answer: '''يُنسب إلى بني عديّ، وهم قبيلة عدنانية من بطون قريش العشرة.''',
      title: "نسب عمر بن الخطاب"),
  StoryBodyData(
      answer:
          '''لقب عمر بن الخطاب هو الفاروق, ولقب بالفاروق لأن الله فرّق به بين الكفر والإيمان.''',
      title: "لقب عمر بن الخطاب"),
  StoryBodyData(
      answer:
          '''حباه الله سماتٍ أهلّته لأن يكون من الرِّجال الذين لهم دورٌ في رسم خطوط التاريخ.''',
      title: "شخصية عمر بن الخطاب"),
  StoryBodyData(
      answer: '''شكل عمر بن الخطاب
دعونا نبحر ونرسم صورته المهيبة في خيالنا

فقد كان ضخماً طويلاً أصلع الرّأس، كثيف اللّحية، عريض الكتفين، قويّ البُنية.
وفي عينيه حَوَرٌ، وفي لحيته صُفرةٌ، وفي عينيه حُمرة.
يميل إلى السُّمرة في لون بشرته، وفي رواية أنه كان أبيض اللّون واسمرّ عام الرّمادة من شدّة ما أصابه من التّعب والجهد تحت أشعة الشّمس وهو يتفقّد أحوال الرَّعية.
أخلاق عمر بن الخطاب
أما عن أخلاقه فلنتأمل ونقتدي

كان زاهداً في الدّنيا مقبلاً على ما عند الله حتى قال عنه عثمان رضي الله عنه: يرحم الله عمراً، من يطيق ما كان يطيق عمر؟!!.

هيبة عمر بن الخطاب

بما أعطاه من صورة في جسمه وبدنه
وما لاقاه من مواقف في حياته
وبشديد ذله وانكساره بين يدي خالقه ومولاه
قال ابن عبّاس: (مَكَثْتُ سنة أريد أنْ أسأل عمر بن الخطَّاب عن آيةٍ، فما أستطيع أنْ أسأَلَهُ هَيْبَةً له).

حبّه لذكر الله والبكاء من خشيته

كان الصّحابة يسمعون صوت بكائه وهو يتلو الآيات.
وكان في وجهه خطّان من أثر الدّموع، فقد كان يبكي عند الكعبة، فالتفت إليه رسول الله وقال له: «ههنا تُسكَبُ العَبَرات».
تواضع عمر بن الخطاب

كان متواضعاً أمام خالقه وبين رعيّته، على الرغم ما كان له من الهيبة وما كان تحت حكمه من بلادٍ.
كان ينام في المسجد ويتجوّل بين رعيّته دون أن يكون له جيشٌ يحرسه.
لمّا دخل عليه الهُرمُزان؛ رآه ممدّداً في المسجد دون حرس، فقال: هذا والله الملك الهنيء.
لمّا دخل عليه وفدٌ خاضعون لحكمه أحسّ بالعزّة في نفسه، فأراد أن يمحوها فخرج حاملاً الماء على ظهره.
احزمه في الدّين وغضبه لانتهاك محارم الله

شبّهه رسول الله بنبيّ الله نوحٍ -عليه السّلام- لشدَّته في أمر الله..

ومن غيرته على حرمات الله ما ثبت عن أبي هريرة -رضي الله عنه-: (بَيْنَا نَحْنُ عِنْدَ رَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، إذْ قالَ: بيْنَا أَنَا نَائِمٌ رَأَيْتُنِي في الجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إلى جَانِبِ قَصْرٍ فَقُلتُ: لِمَن هذا القَصْرُ؟ فَقالوا: لِعُمَرَ بنِ الخَطَّابِ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا، فَبَكَى عُمَرُ وقالَ: أَعَلَيْكَ أَغَارُ يا رَسولَ اللَّهِ).''',
      title: "صفات عمر بن الخطاب"),
  StoryBodyData(
      answer: '''تزوّج -رضي الله عنه- سبع نساء في الجاهليّة والإسلام:

زينب بنت مظعون
مليكة بنت جرول ولكنّه طلّقها
قُريبة بنت أبي أُميّة المخزوميّ ثُمّ طلّقها
أُم حكيم بنت الحارث بن هشام، ثُمّ طلّقها، وقيل لم يُطلّقها
جميلة بنت عاصم
عاتكة بنت زيد
أُم كلثوم بنت علي بن أبي طالب -رضي الله عنهما
أولاد عمر بن الخطاب
كان له تسعةٌ من الأبناء الذّكور، وهم: عبد الله؛ الفقيه والمحدث، وعُبيد الله وعاصم وزيد الأكبر وزيد الأصغر وعبد الرحمن الأكبر وعياض وأبو شحمة عبد الرحمن الأوسط، عبد الرحمن الأصغر.
ومن الإناث سبعة، وهنّ: حفصة؛ أم المؤمنين ورُقيّة وفاطمة وعائشة وصفيّة وجميلة وزينب.''',
      title: "زوجات عمر بن الخطاب"),
  StoryBodyData(
      answer: '''مهنة عمر بن الخطاب قبل الإسلام
وُلد في مكة المكرمة وعاش في طفولته حياة الفقر والعوز، وشدة الحياة وقسوتها، فعمل في رعي الإبل، مما ترك أثراً كبيراً في شخصيته، فجعله أكثر مقاومة للصعاب، وأشد تحملاً للمسؤولية، وأبعد عن حب الراحة والترف.
وفي مرحلة الشباب انتقل من العمل برعي الإبل إلى التجارة، واستطاع أن يجمع ثروة، فقد رُوي عنه أنه قال لعياش بن أبي ربيعة حينما أراد الرجوع إلى مكة بعد الهجرة: (والله إنك لتعلم أني من أكثر قريش مالا فلك نصف مالي ولا تذهب معهما)، يقصد أبا جهل والحارث بن هشام.
كنية عمر بن الخطاب قبل الإسلام
لقب بأبي حفص، والحفصُ: هو الأسد، وقالوا: كني عمر بذلك لشجاعته وقوته وخفته، فيذكرون عنه أنه كان يمسك أذن الفرس بيد ويثب على ظهر الفرس، دون أن يعتمد على شيء.''',
      title: "عمر بن الخطاب قبل الإسلام"),
  StoryBodyData(
      answer:
          '''دخل في الإسلام وهو في سن السادسة والعشرين، وكان الرجل الأربعين في ترتيب من دخلوا في الإسلام، ولم يتم تحديد تاريخ دخوله في الإسلام، ولكن ابن إسحاق ذكر أنه دخل في الإسلام بعد الهجرة الأولى إلى الحبشة، وقد ذكر الواقدي أنه أسلم في ذي الحجة من السنة السادسة للبعثة.''',
      title: "متى أسلم عمر بن الخطاب"),
  StoryBodyData(
      answer:
          '''خرج الفاروق -رضي الله عنه- عازماً على قتل رسول الله -صلّى الله عليه وسلّم-، فصادفه رجلٌ في طريقه مُعلِماً إيّاه أنّ أخته قد أسلمت، فانطق إليها حاملاً إليها غضبه وحنقه.
فلم وصل إذ بها تقرأ آياتٍ من سورة طه، فتأكّد من إسلامها وضربها وزوجها، ولما رأى دمها يسيل من رأسها رقَّ فسألها طالباً ما كانت تقرأه، فأعطته إيّاه بعد أن اغتسل. فقرأ من سورة طه حتى قوله -عزّ وجلّ: ﴿ إِنَّني أَنَا اللَّـهُ لا إِلـهَ إِلّا أَنا فَاعبُدني وَأَقِمِ الصَّلاةَ لِذِكري﴾.
فانطلق عمر بن الخطّاب -رضي الله عنه- إلى مكان رسول الله -صلّى الله عليه وسلّم- ومَن معه من الصحابة، وأعلن إسلامه وتوحيده لله -تعالى-، وبأنّ محمّداً عبد الله ورسوله.
هاجر إلى المدينة المنورة علناً ومتحدياً، فخرج إلى الكعبة المشرفة، وطاف بها سَبْعاً، وصلّى ركعتَين عند المقام، ثمّ دار على المشركين وهو يحمل سيفه وقوسه وسهامه، وخاطبهم قائلاً: (شاهت الوجوه، لا يرغم الله إلّا هذه المعاطس، مَن أراد أن تثكله أمّه ويُيتّم ولده وتُرمّل زوجته، فليلقني وراء هذا الوادي)، فلم يلحق به أحدٌ.
لماذا سمي عمر بن الخطاب بالفاروق؟
لقب بالفاروق لأن الله فرّق به بين الكفر والإيمان، وذلك أنّ إسلامه كان عزاً للإسلام والمسلمين، فبعد أن كان النبي والصحابة يجتمعون في دار الأرقم بن الأرقم بعيداً عن أعين الناس، أصبحوا بعد إسلامه رضي الله عنه يخرجون للصلاة عند الكعبة، ويجاهرون بدعوتهم أمام الملأ.
رأى عمر أنّ المسلمين على الحق فلماذا يخفون أنفسهم، فخرج يوماً يتقدم مجموعة للمسلمين بينما يتقدم الأخرى حمزة بين عبد المطلب رضي الله عنه، وعيون المشركين ترقبهم بغيظٍ ولا تقدر أن تفعل شيئا لقوة عمر وبأسه.


فوائد من اسلام عمر بن الخطاب
شعر المسلمون بالعزّة والقوة والمنعة، فلم يكن أحدٌ منهم يستطيع أن يُصلِّي علانية، أو يطوف حول الكعبة، وانتصفوا ممّن ظلمهم، وقد أعلن إسلامه للمشركين، فأصابتهم الكآبة من هذا الخبرِ الصعب عليهم، وقد أشار ابن مسعود إلى هذا المعنى فقال: (ما كنا نقدر أن نُصلِّي عند الكعبة حتى أسلم عمر).

إنجازات عمر بن الخطاب
عمر بن الخطاب، الخليفة الثاني للمسلمين، قام بالعديد من الإنجازات المهمة، منها:

جمع القرآن الكريم: في عهده تم جمع القرآن الكريم وتدوينه في صورته النهائية للحفاظ عليه.
تأسيس التقويم الهجري: أسس التقويم الهجري الذي يعتمد على هجرة النبي محمد من مكة إلى المدينة كنقطة بداية.
توسيع الدولة الإسلامية: خلال عهده، اتسعت حدود الدولة الإسلامية لتشمل كامل العراق ومصر وليبيا والشام وفارس.
إنشاء نظام الدواوين: قام بإنشاء نظام الدواوين لتنظيم الشؤون الإدارية والمالية
تأسيس بيت المال: أنشأ بيت المال لإدارة الموارد المالية للدولة.
توسيع المساجد الرئيسية: قام بتوسيع المسجد الحرام وتعمير المسجد النبوي.
تأسيس مبادئ الإدارة والحكم: أسس مبادئ الإدارة الرشيدة والشورى ووضع دستور الحرب ومعاملة الرعية والمواطنين.''',
      title: "عمر بن الخطاب في عهد النبي صلى الله عليه وسلم"),
  StoryBodyData(
      answer: '''القرآن الكريم نزل موافقاً لرأي الفاروق في العديد من الأحداث:

رأيه في أسرى بدر: فبعد انتهاء معركة بدرٍ استشار النبي -عليه الصلاة والسلام- بعض الصحابة في الأسرى، فكان رأي أبا بكر أخذ الفدية، وكان رأي الفاروق أن يُقتلوا ولا يؤخذ منهم فدية، فأخذ رسول الله -صلى الله عليه وسلم- برأي أبي بكر رضي الله عنه، ولكن القرآن الكريم نزل موافقاً لرأي عمر رضي الله عنه، حيث قال تعالى:
﴿ ما كانَ لِنَبِيٍّ أَن يَكونَ لَهُ أَسرى حَتّى يُثخِنَ فِي الأَرضِ تُريدونَ عَرَضَ الدُّنيا وَاللَّـهُ يُريدُ الآخِرَةَ﴾.

اتّخاذ مقام إبراهيم مصلى
عدم الصلاة على رأس المنافقين عبد الله بن أبي بن سلول عند وفاته
مسألة حجاب أمّهات المؤمنين''', title: "صفات عمر بن الخطاب بعد الإسلام"),
  StoryBodyData(
      answer:
          '''كان للفاروق المشاركة القوية في جميع الغزوات مع رسول الله، وهذه قائمة الغزوات التي شارك فيها الفاروق عمر بن الخطاب وهي 28 غزوة بداية من غزوة الابواء حتى أخر غزوة وهي غزوة تبوك

الغزوات التي شارك فيها عمر بن الخطاب رضي الله عنه

عام 2 هـ : غزوة الأبواء، غزوة بواط، غزوة العشيرة، غزوة بدر الأولى، غزوة بدر الكبرى، غزوة بني سليم، غزوة بني قينقاع، غزوة السويق.
عام 3هـ: غزوة ذي أمر، غزوة بحران، غزوة أحد، غزوة حمراء الأسد.
عام 4 هـ: غزوة بني النضير، غزوة ذات الرقاع، غزوة بدر الآخرة.
عام 5هـ: غزوة دومة الجندل، غزوة بني المصطلق، غزوة الخندق، غزوة بني قريظة.
عام 6هـ: غزوة بني لحيان، غزوة ذي قرد، غزوة الحديبية صلح الحديبية.
عام 7هـ: غزوة خيبر، غزوة عمرة القضاء.
عام 8هـ: فتح مكة، غزوة حنين، غزوة الطائف.
عام 9هـ: غزوة تبوك''',
      title: "غزوات عمر بن الخطاب"),
  StoryBodyData(
      answer: '''من مواقف عمر بن الخطاب في خلافته

لمّا وصل تاج كسرى وسواريه لعمر بن الخطاب -رضي الله عنه- قال: “إنَّ الذي أدَّى هذا لأمين”، فقال له رجل: “يا أمير المؤمنين، عففتَ فعفوا، ولو رتعت لرتعوا“''',
      title: "خلافة عمر بن الخطاب"),
  StoryBodyData(
      answer: '''أهم الفتوحات في عهد عمر بن الخطاب :

فتح دمشق
سار المُسلمون إليها مع أميرهم خالد بن الوليد والتقوا مع الرّوم بقيادة باهان، وحصل بينهم قتال شديد، وهُزم بعدها الرّوم، مما أجبرهم على دُخولِ دمشق وإغلاق الأبوابِ عليهم.
فحاصرها المُسلمون وكان أن سمع خالد بقيام الروم بإقامة حفلٍ لصاحب دمشق، فهيّأ السلالم للدخول عليهم في المساء، وتسلّق بعض الصحابة الكِرام على السور، وفتحوا الباب لبقيّةِ الجيش، ودخل عليهم خالد ثم اتّفق معهم على الصُّلح، وكتب بذلك إلى عُمر -رضي الله عنه-.
فتح عمر بن الخطاب للقدس
كتب عمرو بن العاص إلى عُمر -رضي الله عنهُما- يستشيرهُ في أمرِ القُدس، فترك الأمر إليه، فبدأ بمعركة أجنادين التي كانت تمهيداً لفتح القُدس.
ووزّع أرطبون قائد الرّومان في القُدس جُنوده على الرملة وإيليا اللتان تبعُدان ثمانية عشر ميلاً عن القُدس؛ استعداداً لأي تحرُّكٍ من المُسلمين، فكانت خُطة عمرو بن العاص بإشغال الرومان في فلسطين حتى ينتصر في أجنادين.
ثُمّ يتفرّغ هو ومن معه لفتح القُدس، ثُمّ قام عمرو -رضي الله عنه- بإشغال الرومان في الرملة وإيليا بإرسال قواتٍ من المُسلمين لقتالهم، وأنهى معركته في أجنادين.
ثُمّ حاصر إيليا ثلاثة أيام، وبدأ بعدها برمي السهام عليهم، واستمر ذلك الحال إحدى عشر يوماً، حتى جاء أبو عُبيدة وخالد، مما جعل أهل إيليا يرتعبون من ذلك.
وحاصروهم أربعة أشهر إلى أن يئسوا مما هُم فيه، فقرّروا الاستسلام، وجاء عُمر واستلم مفاتيحها منهم.
معركة عمر بن الخطاب مع الفرس
كتب المثنى بن حارثة إلى الخليفة عمر يستحثه على الهجوم وانتهاز فرصة جلوس يزدجرد الثالث حديث السن على العرش، لكن الجيوش الفارسيَّة بقيادة رستم انتصرت في موقعة الجسر.
وقُتل المُثنى وأبو عبيدة بن مسعود الثقفي، فعهد الخليفة بالقيادة إلى سعد بن أبي وقاص، فقصد سعد القادسية، وانتصر في معركة القادسية الشهيرة ودحر جيوش الفرس.
أسّس سعد مدينة الكوفة، ثم توغل واستولى على المدائن، فهرب يزدجر وجمع حوله جيشاً من جديد، وتبعه سعد وأوقع به فهرب يزدجر إلى خراسان.
وأرسل الخليفة عمر مجموعة من القادة ففتحت نهاوند، والأهواز، وتوقفت الفتوحات باستشهاد الخليفة عمر.''',
      title: "فتوحات عمر بن الخطاب"),
  StoryBodyData(
      answer:
          '''عمر بن الخطاب رضي الله عنه استُشهد في السنة الثالثة والعشرين للهجرة. تفصيل كيفية استشهاده يذكر أنه قتل على يد أبو لؤلؤة المجوسي، وهو غلام المغيرة بن شعبة. حدث ذلك أثناء تولي عمر بن الخطاب صلاة الفجر إماماً في المسجد. قام أبو لؤلؤة بطعن عمر رضي الله عنه عدة طعنات أدت إلى وفاته بعد بضعة أيام من الطعنة.''',
      title: "مقتل عمر بن الخطاب صحيح البخاري"),
  StoryBodyData(
      answer:
          '''في آخر حجّة لعمر بن الخطاب رضي الله عنه، وفي طريق العودة دعا الله -تعالى- قائلاً:
(اللَّهُمَّ كَبِرَتْ سِنِّي، وضَعُفَتْ قُوَّتي، وانتشرَتْ رَعِيَّتي، فاقبِضْني إليكَ غيرَ مُضَيِّعٍ ولا مُفَرِّطٍ)، ورُوي أنه كان يتمنّى الشهادة في سبيل الله قائلاً:

(اللَّهُمَّ ارْزُقْنِي شَهَادَةً في سَبيلِكَ، واجْعَلْ مَوْتي في بَلَدِ رَسولِكَ صَلَّى اللهُ عليه وسلَّمَ).

وبالفعل استجاب الله تعالى دعاء الفاروق رضي الله عنه، ففي أحد الأيام تقدّم عمر بن الخطاب ليؤمّ الناس في صلاة الفجر كعادته، وما إن استوت الصفوف، وكبّر للصلاة، حتى بُغت بطعنةٍ غادرةٍ من المدعوّ أبو لؤلؤة المجوسي.
ثم أخذ المجوسي يطعن المصلّين ميمنة وميسرة حتى أصاب ثلاثة عشر رجلاً، توفّي منهم سبعة، ولمّا ظنّ أنه مأخوذٌ نحر نفسه.''',
      title: "ماذا قال عمر بن الخطاب عند وفاته"),
  StoryBodyData(
      answer:
          '''لمّا أيقن الصحابة بموته -رضيَ الله عنه- طلبوا منه اختيار خليفةً للمُسلمين من بعده، فرشَّح لهم ستّة من الصّحابة وهم بقيّة العشرة المبشّرين بالجنّة، ليختاروا من بينهم واحداً، ولكنّهُ استبعد منهم ابن عَمّه سعيد بن زيد، كما استبعد أيضاً ابنه عبد الله.
ولمّا أيقن بِقُرب موته، وقال لابنه عبدُ الله أن يُحصي ما عليه من دَيْنٍ، فوجدها سِتَّةً وَثَمَانِينَ أَلْفًا، فطلب منه أن يسدّها من ماله ومن مال أهله، فإن لم تكفِ فمن مال عشيرته، فإن لم تكفِ فمن قُريش.''',
      title: "وصية عمر بن الخطاب قبل موته"),
  StoryBodyData(
      answer:
          '''أمر عمر ابنه عبد الله أن يستأذن أم المؤمنين عائشة -رضي الله عنها- بأن يُدفن بجوار صاحبيه رسول الله صلى الله عليه وسلم وأبو بكر الصديق رضي الله عنه، فأذنت له.
وكان استشهاده يوم الأربعاء، لأربع بقين من شهر ذي الحجة من العام الثالث والعشرين للهجرة.''',
      title: "دفن عمر بن الخطاب"),
];
