// ignore_for_file: file_names

import 'package:azkar/model/story_model.dart';

List<StoryBodyData> osmanData = [
  StoryBodyData(
      answer:
          '''عثمان بن عفان هو ثالث الخلفاء الراشدين بعد أبو بكر الصديق وعمر بن الخطاب، ومن العشرة المبشرين بالجنة ولد في مكة المكرمة عام 557 م  بعد مولد الرسول محمد صلى الله عليه وسلم بست سنوات وبعد عام الفيل بست سنين، لقب بذي النورين و لقب بذلك بسبب زواجه من ابنتي الرسول صلى الله عليه وسلم رقية والسيدة أم كلثوم.

''',
      title: "من هو عثمان بن عفان رضي الله عنه؟"),
  StoryBodyData(
      answer:
          '''عُرِف عثمان بن عفان بأخلاقه الحميدة حيث كان شديد الحياء، كريماً، كثير الإنفاق في سبيل الله، وتقياً، وطيب المعاملة، ولين المعشر، كما كان عثمان رضي الله عنه، كان رجلاً ليس بالطويل ولا بالقصر، وكان أسمر اللون، حسن الوجه، أصلع، رقيق البشرة، كثَّ اللحية كثير شعر الرأس''',
      title: "صفات عثمان بن عفان"),
  StoryBodyData(
      answer:
          '''كان عثمان بن عفان من أفضل الناس في قومه أيام الجاهلية، فكان قومه يحبونه أشد الحبّ كما أنه لم يسجد في الجاهلية لصنم قط ولم يقترف فاحشة قط ولم يشرب خمراً قبل الإسلام''',
      title: "مكانة عثمان بن عفان في الجاهلية"),
  StoryBodyData(
      answer:
          '''لقب عثمان بن عفان بذي النورين، والمراد بالنورين ابنتا النبي صلى الله عليه وسلم “رقية” و”أم كلثوم” رضي الله عنهما؛ حيث زوجه النبي صلى الله عليه وسلم ابنته رقية، وحين توفيت زوجه ابنته الثانية أم كلثوم رضي الله عنهما''',
      title: "لقب عثمان بن عفان"),
  StoryBodyData(
      answer:
          '''استجاب عثمان بن عفان لدعوة أبو بكر الصديق له إلى الإسلام، فأسلم في سن الرابعة والثلاثين من عمره وكان بذلك أول الناس إسلامًا بعد أبي بكر وعلي وزيد بن حارثة عثمان فكان بذلك رابع من أسلم من الرجال''',
      title: "اسلام عثمان بن عفان"),
  StoryBodyData(answer: '''زوجات عثمان بن عفان
تزوج عثمان بن عفان ثماني زوجات بعد الإسلام وهنَّ: رقية وأم كلثوم ابنتا رسول الله صلى الله عليه وسلم، فاطمة بنت الوليد، كما تزوج من فاختة بنت غزوان، وأم البنين بنت عيينة، رملة بنت شيبة، نائلة بنت الفرافصة أنجب منهم عدداً من الأولاد والبنات.

ابناء عثمان بن عفان
عبد الله بن عثمان، وأمه رقية بنت الرسول صلى الله عليه وسلم.
 عبد الله الأصغر من فاختة بنت غزوان.
عمرو وخالد وأبان وعمر ومريم، وأمهم أم عمرو بنت جندب الأزدية .
الوليد وسعيد وأم سعد، وأمهم فاطمة بنت الوليد بن عبد شمس.
عبد الملك وأمه أم البنين بنت عيينة بن حصن الفزارية.
 عائشة وأم أبان وأم عمرو وأمهنَّ رملة بنت شيبة بن ربيعة.
اسمها مريم وامها نائلة''', title: "اسرة عثمان بن عفان"),
  StoryBodyData(
      answer:
          '''بعدما ضاقت الأحوال على المسلمين في مكة، أذن لهم الرسول صلى الله عليه وسلم بالهجرة إلى الحبشة في العام الخامس للهجرة، وكانوا  عشرة رجال وأربع نسوة وهم: عثمان بن عفان، وامرأته رقية بنت رسول الله ﷺ، وأبو حذيفة بن عتبة، وامرأته سهلة بنت سهيل،

والزبير بن العوام، ومصعب بن عمير، وعبد الرحمن بن عوف، وأبو سلمة بن عبد الأسد، وامرأته أم سلمة بنت أبى أمية، وعثمان بن مظعون، وعامر بن ربيعة العنزي، وامرأته ليلى بنت أبى حثمة، وأبو سبرة بن أبى رهم، وحاطب بن عمرو، وسهيل بن بيضاء، وعبد الله بن مسعود رضي الله عنهم أجمعين.''',
      title: "هجرة عثمان بن عفان إلى الحبشة"),
  StoryBodyData(
      answer: '''مساهمات عثمان بن عفان الاقتصادية في بناء الدولة
كان عثمان بن عفان صاحب تجارة ومن الأغنياء وكان يملك أموال طائلة و أستخدم تلك الأموال في طاعة الله عز وجل وكان سباقًا للخير لايخشى الفقر ومن الأمور الذي ساهم بها من ماله الخاص:

بئر رومة ( وقف عثمان بن عفان )
بعدما هاجر المسلمون إلى المدينة المنورة لم يستسيغوا ماءها وكان بئر رومة من أعذب مياه الآبار في المدينة وكانوا يشربون منه بأجرٍ مدفوع و أرهقهم ذلك، وبعد ذلك حث الرسول صلى الله عليه وسلم أصحابه على شراء البئر والتبرع به للمسلمين مقابل عين في الجنة فاشتراه عثمان بن عفان وجعل البئر وقفًا للمسلمين.

وقف عثمان بن عفان


توسعة المسجد النبوي

بعد بناء المسجد النبوي في المدينة صار المسلمون يجتمعون داخله في أوقات الصلوات وخطب الرسول كما كانوا يأتون إليه بهدف تعلم تعاليم دينهم و ينطلقون منه إلى الغزوات وبسبب ذلك ضاق المسجد بالناس فقرر الرسول شراء بقعة بجانب المسجد بهدف توسعته فاشتراها عثمان بن عفان وأضيفت للمسجد النبوي.

توسعة المسجد النبوي

تجهيز جيش العسرة
عندما أراد الرسول صلى الله عليه وسلم الخروج إلى غزوة تبوك حث الأغنياء على البذل لتجهيز جيش العسرة الذي أعده الرسول لغزو الروم فقام الصحابة بالتبرع كل حسب طاقته وجهده أما عثمان فقد تبرع بنفقة عظيمة لم يتبرع أحد مثله.''',
      title: "مساهمات عثمان بن عفان الاقتصادية في بناء الدولة"),
  StoryBodyData(
      answer:
          '''من الأحاديث التي ذكرها الرسول صلى الله عليه وسلم في عثمان بن عفان:

اهدأ فما عليك إلا نبي أو صديق أو شهيد
عن أبي هريرة رضي الله عنه: أن رسول الله صلى الله عليه وسلم كان على حراء، وأبو بكر، وعمر وعثمان، وعلي وطلحة، والزبير، فتحركت الصخرة، فقال رسول الله صلى الله عليه وسلم : إهدأ فما عليك إلا نبيُ أو صديقُ أو شهيدُ.

 أصدقها حياءً عثمان
عن أنس بن مالك قال: أرحم أمتي أبو بكر وأشدها في دين الله عمر، وأصدقها حياء عثمان، وأعلمها بالحلال والحرام معاذ بن جبل، وأقرؤها لكتاب الله أُبَيْ وأعلمها بالفرائض زيد بن ثابت، ولكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح

افتح له وبشره بالجنة على بلوى تصيبه
روي عن أبي موسى الأشعري رضي الله عنه أنه قال: كنت مع النبي في حائط من حيطان المدينة فجاء رجل فاستفتح، فقال النبي صل الله عليه وسلم: افتح له وبشره بالجنة ففتحت له فإذا هو أبو بكر فبشرته بما قال رسول الله فحمد الله ثم جاء رجل فاستفتح فقال النبي:

افتح له وبشره بالجنة ففتحت له فإذا هو عمر فأخبرته بما قال رسول الله فحمد الله ثم جاء رجل فاستفتح فقال لي: افتح له وبشره بالجنة على بلوى تصيبه فإذا عثمان فأخبرته بما قال رسول الله فحمد الله ثم قال: الله المستعان.''',
      title: "عثمان بن عفان في عهد رسول الله"),
  StoryBodyData(
      answer: '''عثمان بن عفان في عهد أبي بكر الصديق
كان عثمان بن عفان من الصحابة الذي له شأن كبير بين أفراد قومه وكان له رأيُ ومشورى في الكثير من المسائل وأهمها خلافة أبو بكر واختيار عمر بن الخطاب خليفة بعده، حيث لما أشتد المرض بأبي بكر قام باستشارة الناس فيمن يحبون أن يقوم بأمر الخلافة بعده فاختاروا عمر كما أختار عثمان رضي الله عنه عمر بن الخطاب.

أستمع الى: سيرة الصحابي أبو بكر الصديق

عثمان بن عفان في عهد عمر الفاروق
حظي عثمان بن عفان بمكانة متميزة في عهد عمر بن الخطاب وكان مقامه كمقام الوزير من الخليفة، كما أشار عثمان رضي الله عنه على عمر بفكرة الديوان وكتابة التاريخ كما جاء في بعض الروايات''',
      title: "عثمان بن عفان في عهد الخلفاء الراشدين"),
  StoryBodyData(
      answer:
          '''بعد مرض عمر بن الخطاب  قام  بترشيح ست أسماء للخلافة من بعده وهم: علي بن ابي طالب، وعثمان بن عفان، وعبد الرحمن بن عوف، وسعد بن أبي وقاص، والزبير بن العوام، وطلحة بن عبيد الله رضي الله عنهم جميعًا، وأمرهم أن يجتمعوا في بيت أحدهم ويتشاوروا فيما بينهم.

وفيهم عبد الله بن عمر يحضر معهم مشيراً فقط وفي حال عدم الرضى بما حكمه أمرهم بأن  يكونوا مع الّذين فيهم عبد الرَّحمن بن عوف، ويصلِّي بالناس أثناء التَّشاور صهيب الرُّوميُّ، حتَّى لا يولِّي إمامة الصلاة أحداً من السِّتَّة، وأمر المقداد بن الأسود، وأبا طلحة الأنصاريَّ أن يرقبا سير الانتخابات، وبعد مشاورات دامت ثلاثة أيام تم أختيار عثمان بن عفان خليفة على المسلمين.

منهج عثمان بن عفان في الحكم
بعد تسلم عثمان بن عفان الخلافة خطب خطبتًا وأعلن فيها عن منهجه السياسي في إدارة الحكم ويمكن ذكرها على النحو التالي:

المرجعية العليا للدولة
أعلن ذو النورين أن المرجعية الأساسية لقيادة الدولة كتاب الله وسنة رسوله صلى الله عليه وسلم و الاقتداء بأبي بكر وعمر.

حق الأمة في محاكمة الخليفة
سلطة الخليفة ليست مطلقة وإنما مقيدة بعدم مخالفة ما جاء في القرآن الكريم والسنة وألا تخالف ما اتفقت عليه الأمة الإسلامية.

الشورى مع المسلمين 
من قواعد الدولة الإسلامية حتمية تشاور قادة الدولة  والمسلمين والوصول إلى حكم يرضي جميع الأطراف.

العدل والمساواة
من أهداف الحكم الإسلامي الحرص على إقامة قواعد النظام الإسلامي وأهم القواعد: العدل والمساواة حيث كانت سياسته قائمة على العدل بأسمى صوره.

الحريات 
مبدأ الحرية من المبادئ الأساسية التي قام عليها الحكم في عهد الخلفاء الراشدين والذي يحث على تأمين وكفالة الحرية العامة للناس كافة ضمن  حدود الشريعة الإسلامية''',
      title: "خلافة عثمان بن عفان"),
  StoryBodyData(
      answer: '''المراحل التي مرت بها كتابة القرآن الكريم
في العهد النبوي
اكتمل نزول القرآن الكريم في زمن الرسول صلى الله عليه وسلم، لكنه لم يُجمع في مصحف واحد في عهده، وكان الصحابة يكتبون ما ينقله الرسول لهم من آيات وسور قرآنية.

في عهد أبي بكر الصديق
في عهد أبو بكر استشهد خمسمائة حافظ للقرآن في معركة اليمامة  فقرر الخليفة ابو بكر جمع الآيات والسور في كتاب موحد، حرصًا منه على حفظ القرآن من الضياع، فأوكل مهمة كتابة القرآن وجمعه إلى زيد بن ثابت بشرط وجود شاهدين لكل آية يتم كتابتها وبذلك تم نقل الآيات بعناية وحذر.

في عهد عثمان بن عفان
قرر الخليفة عثمان إعادة توحيد المسلمين على مصحف واحد (المصحف الإمام) بسبب انتشار الكثير من النسخ المكتوبة والمنقولة بشكل خاطئ مما أدى إلى وقوع خلافات بين الناس على المصحف الصحيح وتم طباعة ستة نسخ وتوزيع نسخة لكل دولة وهم:

افريقيا، ومصر، الشام، العراق، بلاد فارس ونسخة بقيت لدى عثمان بن عفان، وأمر بحرق جميع النسخ الأخرى الموجودة مع الناس بهدف التأكد من عدم وجود أي نسخ خاطئة من القرآن الكريم.''',
      title: "جمع القرآن الكريم في عهد عثمان بن عفان"),
  StoryBodyData(
      answer: '''قسم عثمان الجبهات العسكرية إلى ثلاثة أقسام

الجبهة الشرقية: حصل العديد من الفتوحات في هذه الجبهة وتم تقسيمها الى معسكرين وهما، معسكر البصرى و معسكر الكوفة، ومن الفتوحات التي حصلت فيها فتوحات أهل الكوفة، وغزو سعيد بن العاص طبرستان.
الجبهة الشمالية: مركزها دمشق ومنها ينطلق المسلمون لقتال الروم، حصل فيها العديد من الفتوحات كـ فتوحات حبيب بن مسلمة الفهري وغزو القبرص.
الجبهة الغربية: مركزها مدينة الفسطاط و التي بناها عمرو بن العاص، وحالياً هي مدينة مصر، من الفتوحات التي حصلت فيها، فتح بلاد النوبة، وفتح إفريقيا''',
      title: "أهم الفتوحات التي حصلت في عهد عثمان بن عفان"),
  StoryBodyData(
      answer: '''الشبهات التي طعن بها عثمان
استلم عثمان الحكم اثنتي عشرة سنة أميراً للمؤمنين، أول ست سنين منها لم ينقم الناس على عثمان بشيء لكن في النصف الثاني من ولايته بدأت الفتنة، وبدأت الدعاوى تروج ضده ويمكن تقسيم الشبهات التي وجهت لعثمان على النحو التالي:

مواقف شخصية له قبل توليه الخلافة كـ تغيبه عن بعض الغزوات والمواقع ..
سياسته المالية: الأعطيات..
سياسته الإدارية: تولية أقربائه، طريقته في التولية..
اجتهادات خاصة به، أو بمصلحة الأمة كـ إتمام الصلاة بمنى، جمع القرآن، الزيادة في المسجد..
معاملته لبعض الصحابة كـ عمار و أبي ذر وابن مسعود.''',
      title: "الفتنة التي حصلت ضد عثمان بن عفان"),
  StoryBodyData(
      answer:
          '''نشبت فتنة في النصف الثاني من خلافة عثمان بن عفان، وقُتل ظلماً على إثرها في اليوم الثامن عشر، من ذي الحِجّة، من السنة الخامسة والثلاثين للهجرة، بعدما مُنِع الطعام والشراب عنه وتم حصاره وقتله في منزله، وبعد وفاته حزن الصحابة والصحابيات حزناً شديداً عليه ومنهم، السيدة عائشة وعلي بن أبي طالب رضوان الله عليهم.''',
      title: "استشهاد عثمان بن عفان"),
];
